InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РегистрацияОрганизацииСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Проверяет в переданном списке учредителей наличие иностранных граждан
//
// Параметры:
//  Учредители - ДанныеФормыКоллекция - список учредителей
//
// Возвращаемое значение:
//  Булево - Истина, если среди учредителей (или их представителей) есть хоть один иностранный гражданин
//
Функция ЕстьУчредителиИлиПредставителиИностранныеГраждане(Учредители) Экспорт
	
	ПроверяемыеФизЛица = Новый Массив;
	Для Каждого ДанныеУчредителя Из Учредители Цикл
		Если ЗначениеЗаполнено(ДанныеУчредителя.ПредставительУчредителя) Тогда
			ПроверяемыеФизЛица.Добавить(ДанныеУчредителя.ПредставительУчредителя);
		Иначе
			ПроверяемыеФизЛица.Добавить(ДанныеУчредителя.Учредитель);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, ФизическоеЛицо В (&ФизическиеЛица)) КАК ГражданствоФизическихЛицСрезПоследних
		|ГДЕ
		|	ГражданствоФизическихЛицСрезПоследних.Страна <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|	И ГражданствоФизическихЛицСрезПоследних.Страна <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ФизическиеЛица", ПроверяемыеФизЛица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ЗаполнитьСписокВыбораГражданства(Форма, СвойстваРоссии) Экспорт
	
	Перем КодПоУмолчанию, НаименованиеПоУмолчанию;
	
	Элементы = Форма.Элементы;
	
	Если СвойстваРоссии <> Неопределено Тогда
		КодПоУмолчанию = СвойстваРоссии.Код;
		НаименованиеПоУмолчанию = СвойстваРоссии.Наименование;
		Форма.КодРоссии = СвойстваРоссии.Код;
	КонецЕсли;
	
	СписокВыбора = Элементы.Гражданство.СписокВыбора;
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(
		РегистрацияОрганизацииКлиентСервер.КодПустогоЗначенияВСпискеВыбораГражданства(),
		НСтр("ru = 'Без гражданства'"));
	Если ЗначениеЗаполнено(КодПоУмолчанию) Тогда
		СписокВыбора.Добавить(КодПоУмолчанию, НаименованиеПоУмолчанию);
	КонецЕсли;
	
	ТаблицаКлассификатора = РаботаСАдресами.ТаблицаКлассификатора();
	Для Каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
		Если СтрокаКлассификатора.Код <> КодПоУмолчанию Тогда
			СписокВыбора.Добавить(СтрокаКлассификатора.Код, СтрокаКлассификатора.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Форма.Гражданство) И ЗначениеЗаполнено(КодПоУмолчанию) Тогда
		Форма.Гражданство = КодПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
